msa_test_plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="MVP Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager(application/json)">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">content-type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Product-Search-Users">
        <stringProp name="TestPlan.comments">5000 Login-users</stringProp>
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
        <intProp name="ThreadGroup.num_threads">500</intProp>
        <intProp name="ThreadGroup.ramp_time">10</intProp>
        <longProp name="ThreadGroup.duration">3600</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${accessToken}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="TestPlan.comments">comment</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <Summariser guiclass="SummariserGui" testclass="Summariser" testname="Generate Summary Results" enabled="true"/>
        <hashTree/>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="Once Only Controller" enabled="true">
          <stringProp name="TestPlan.comments">For Member Login</stringProp>
        </OnceOnlyController>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Customer Auth Processor" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def threadNum = ctx.getThreadNum()
def loopNum = vars.getIteration()

// customerId 계산
def customerId = ((threadNum + loopNum) % 5000) + 1
def customerIdPadded = String.format(&quot;%012d&quot;, customerId)

// 바로 email, password 생성
def email = &quot;customer${customerId}@example.com&quot;
def password = &quot;1234&quot;

// JMeter 변수로 저장
vars.put(&quot;customerId&quot;, customerIdPadded.toString())
vars.put(&quot;customer-email&quot;, email)
vars.put(&quot;customer-password&quot;, password)
</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="AccessToken Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">accessToken</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.accessToken</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Member Login Request" enabled="true">
            <stringProp name="TestPlan.comments">member login</stringProp>
            <intProp name="HTTPSampler.connect_timeout">3000</intProp>
            <intProp name="HTTPSampler.response_timeout">5000</intProp>
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">8080</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">auth/login</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
    &quot;email&quot; : &quot;${customer-email}&quot;,&#xd;
    &quot;password&quot; : &quot;${customer-password}&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <intProp name="LoopController.loops">-1</intProp>
        </LoopController>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="ProductId PreProcessor" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import java.util.Random

def random = new Random()
def totalProducts = 1000
def zipfExponent = 1.0  // 값이 클수록 상위 상품에 더 집중 (0.8~1.5 권장)

// Zipf 분포: 역변환 샘플링 (Inverse Transform Sampling)
def u = random.nextDouble()  // 0.0 ~ 1.0

// Zipf 분포 근사 공식: rank = (1 / u)^(1/s)
// s=1일 때 전형적인 Zipf, s가 작을수록 완만한 분포
def rank = Math.ceil(Math.pow(1.0 / u, 1.0 / zipfExponent)).intValue()

// 범위 보정: 1 ~ totalProducts 사이로 확실히 제한
if (rank &lt; 1) {
    rank = 1
} else if (rank &gt; totalProducts) {
    rank = totalProducts
}

// UUID 형식으로 변환 (rank를 16진수 12자리로)
def productId = String.format(&quot;00000004-0000-7000-8000-%012d&quot;, rank)

// JMeter 변수에 저장
vars.put(&quot;product-id&quot;, productId)
vars.put(&quot;product-rank&quot;, rank.toString())  // 디버깅용

// 로그 출력 (테스트 시 확인용)
log.info(&quot;=== Zipf Product Selection ===&quot;)
log.info(&quot;Random value (u): ${u}&quot;)
log.info(&quot;Calculated rank: ${rank}&quot;)
log.info(&quot;Product ID: ${productId}&quot;)
log.info(&quot;==============================&quot;)
</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Product Get Request" enabled="true">
            <intProp name="HTTPSampler.connect_timeout">3000</intProp>
            <intProp name="HTTPSampler.response_timeout">5000</intProp>
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">8080</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/products/${product-id}</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="OptionValueId Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">selected-option-value-id</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.optionGroups[*].optionValues[*].id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Product Id Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">selected-product-id</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Store Id Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">selected-store-id</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.store.id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Throughput Controller" enabled="true">
            <intProp name="ThroughputController.style">1</intProp>
            <boolProp name="ThroughputController.perThread">false</boolProp>
            <intProp name="ThroughputController.maxThroughput">1</intProp>
            <FloatProperty>
              <name>ThroughputController.percentThroughput</name>
              <value>10.0</value>
              <savedValue>0.0</savedValue>
            </FloatProperty>
          </ThroughputController>
          <hashTree>
            <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
              <stringProp name="ConstantTimer.delay">2000</stringProp>
            </ConstantTimer>
            <hashTree/>
            <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="DeliveryAddress PreProcessor" enabled="true">
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="script">def customerId = vars.get(&quot;customerId&quot;)

if (customerId == null || customerId.isEmpty()) {
    log.error(&quot;customerId 변수가 설정되지 않았습니다!&quot;)
}

def deliveryAddressId = &quot;00000007-0000-7000-8000-&quot; + customerId

vars.put(&quot;delivery-address-id&quot;, deliveryAddressId)
</stringProp>
            </JSR223PreProcessor>
            <hashTree/>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Order Request" enabled="true">
              <intProp name="HTTPSampler.connect_timeout">3000</intProp>
              <intProp name="HTTPSampler.response_timeout">5000</intProp>
              <stringProp name="HTTPSampler.domain">localhost</stringProp>
              <stringProp name="HTTPSampler.port">8080</stringProp>
              <stringProp name="HTTPSampler.protocol">http</stringProp>
              <stringProp name="HTTPSampler.path">/orders/customer</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <boolProp name="HTTPArgument.always_encode">false</boolProp>
                    <stringProp name="Argument.value">{&#xd;
  &quot;productList&quot;: [&#xd;
    {&#xd;
      &quot;productId&quot;: &quot;${selected-product-id}&quot;,&#xd;
      &quot;optionValueId&quot;: &quot;${selected-option-value-id}&quot;,&#xd;
      &quot;quantity&quot;: 1&#xd;
    },&#xd;
    {&#xd;
      &quot;productId&quot;: &quot;${selected-product-id}&quot;,&#xd;
      &quot;optionValueId&quot;: &quot;${selected-option-value-id}&quot;,&#xd;
      &quot;quantity&quot;: 2&#xd;
    }&#xd;
  ],&#xd;
  &quot;deliveryAddressId&quot;: &quot;${delivery-address-id}&quot;,&#xd;
  &quot;deliveryRequest&quot;: &quot;빠르고 안전하게&quot;,&#xd;
  &quot;couponIdList&quot;: [],&#xd;
  &quot;storeId&quot;: &quot;${selected-store-id}&quot;&#xd;
}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
            </HTTPSamplerProxy>
            <hashTree/>
          </hashTree>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
            <stringProp name="ConstantTimer.delay">2000</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>
      </hashTree>
      <BackendListener guiclass="BackendListenerGui" testclass="BackendListener" testname="Backend Listener" enabled="false">
        <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
          <collectionProp name="Arguments.arguments">
            <elementProp name="apiKey" elementType="Argument">
              <stringProp name="Argument.name">apiKey</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="datadogUrl" elementType="Argument">
              <stringProp name="Argument.name">datadogUrl</stringProp>
              <stringProp name="Argument.value">https://api.us5.datadoghq.com/api/</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="logIntakeUrl" elementType="Argument">
              <stringProp name="Argument.name">logIntakeUrl</stringProp>
              <stringProp name="Argument.value">https://http-intake.logs.datadoghq.com/v1/input/</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="metricsMaxBatchSize" elementType="Argument">
              <stringProp name="Argument.name">metricsMaxBatchSize</stringProp>
              <stringProp name="Argument.value">200</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="logsBatchSize" elementType="Argument">
              <stringProp name="Argument.name">logsBatchSize</stringProp>
              <stringProp name="Argument.value">500</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="sendResultsAsLogs" elementType="Argument">
              <stringProp name="Argument.name">sendResultsAsLogs</stringProp>
              <stringProp name="Argument.value">true</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="includeSubresults" elementType="Argument">
              <stringProp name="Argument.name">includeSubresults</stringProp>
              <stringProp name="Argument.value">false</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="excludeLogsResponseCodeRegex" elementType="Argument">
              <stringProp name="Argument.name">excludeLogsResponseCodeRegex</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="samplersRegex" elementType="Argument">
              <stringProp name="Argument.name">samplersRegex</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="customTags" elementType="Argument">
              <stringProp name="Argument.name">customTags</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="classname">org.datadog.jmeter.plugins.DatadogBackendClient</stringProp>
      </BackendListener>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>